       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

       PROCEDURE DIVISION.
           CALL "UIAUTHREG"
           STOP RUN.

       END PROGRAM MAIN.
