IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
    WORKING-STORAGE SECTION.
       01 WS-FORMATTED-DATE PIC X(19).
       01 WS-DATE.
           05 WS-YEAR   PIC 9(4).
           05 WS-MONTH  PIC 9(2).
           05 WS-DAY    PIC 9(2).
           05 WS-HOUR   PIC 9(2).
           05 WS-MINUTE PIC 9(2).
           05 WS-SECOND PIC 9(2).
           05 WS-REST   PIC X(7).

PROCEDURE DIVISION.
    MOVE FUNCTION CURRENT-DATE TO WS-DATE.

     STRING
       WS-DAY    DELIMITED BY SIZE
       "/"
       WS-MONTH  DELIMITED BY SIZE
       "/"
       WS-YEAR   DELIMITED BY SIZE
       " "
       WS-HOUR   DELIMITED BY SIZE
       ":"
       WS-MINUTE DELIMITED BY SIZE
       ":"
       WS-SECOND DELIMITED BY SIZE
    INTO WS-FORMATTED-DATE

    DISPLAY "CURRENT DATE: " WS-FORMATTED-DATE.
    DISPLAY "LEN CURRENT DATE: " FUNCTION LENGTH(WS-FORMATTED-DATE).

    STOP RUN.